Repository: VaskoViktorov/Library-site
Catalog: Library.Web/Resources/Views/Home/Staff.*.resx
Languages: bg

source: Accounting and cash desk
bg: Каса и счетоводство

source: Administration
bg: Администрация

source: Adriana Tsvetkova
bg: Адрияна Цветкова

source: Art
bg: Изкуство

source: Assembly, Processing and Cataloging
bg: Комплектуване, обработка и каталогизация

source: Automation
bg: Автоматизация

source: Book borrowing
bg: Заемна за възрастни

source: Boriana Dikova
bg: Боряна Дикова

source: Boris Ivanov
bg: Борис Иванов

source: Center for information and referential-bibliographic services
bg: Център за информационно и справочно-библиографско обслужване

source: Children department
bg: Детски отдел

source: Contacts
bg: Информация за контакти

source: Daniela Vurlakova
bg: Даниела Върлакова

source: Department
bg: Отдел

source: Desislava Ivanova
bg: Десислава Иванова

source: Desislava Krusteva
bg: Десислава Кръстева

source: Dimitrina Dimitrova
bg: Димитрина Димитрова

source: Director
bg: Директор

source: Foreign languages reading room
bg: Чуждоезикова читалня

source: Galina Stoianova
bg: Галина Стоянова

source: head dep.
bg: зав.отдел

source: Homeland department
bg: Краезнание

source: Irena Filipova
bg: Ирена Филипова

source: Ivanka Ivanova
bg: Иванка Иванова

source: Kritian Hristov
bg: Кристиян Христов

source: Lidia Velkova
bg: Лидия Векова

source: List with contact information for the staff of Regional Library 'Mihalaki Georgiev' - Vidin
bg: Списък на служителите на Регионална библиотека 'Михалаки Георгиев' - гр. Видин и информация за контакт с тях.

source: Liudmila Siridonova
bg: Людмила Сиридонова

source: Manuela Mitkova
bg: Мануела Миткова

source: Mariana Petrova
bg: Мариана Петрова

source: Maya Manolova
bg: Мая Миланова

source: Methodological
bg: Методичен отдел

source: Milena Gergova
bg: Милена Гергова

source: Milena Ivanova
bg: Милена Иванова

source: Name
bg: Име

source: Natalia Nikolova
bg: Наталия Николова

source: Phone and Email
bg: Телефон и Имейл

source: Reading Rooms - Humanities, accurate and applied science, periodicals
bg: Читални - хуманитарни науки, точни и приложни науки, периодика

source: Service units
bg: Обслужващи звена

source: Specialized units
bg: Специализирани звена

source: Tatiana Nikolova
bg: Татяна Николова

source: Todor Mladenov
bg: Тодор Младенов

source: Todorka Doncheva
bg: Тодорка Дончева

source: Tsvetan Tsekov
bg: Цветан Цеков

source: Valentina Vulcheva
bg: Валентина Вълчева

source: Vasko Viktorov
bg: Васко Викторов
